/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------
/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：从键盘输入月份的英文速写，程序显示数字月份。例如输入"May",
      则程序显示"May是5月份"。
注意：除要求填空的位置之外，请勿改动程序中其他内容。

-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
int main(){
        char *month_name[12]={"Jan","Feb","Mar","Apr","May","Jun","Jul","Aug","Sep","Oct", "Nov","Dec"};
        char mon[10];
        int i;
        gets(mon);
        for(i=0;i<12;i++)
/***********SPACE***********/
         if(strcmp(mon, month_name[i])== 0){
            printf("%s是%d月份\n",mon,i+1);
               break;
                }
/***********SPACE***********/
        if(i==12)
               printf("月份输入错\n");
        return 0;
}






