/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求一组数中大于平均值的数的个数。
例如：给定的一组数为1,3,6,9,4,23,35,67,12,88时，函
      数值为3。

------------------------------------------------*/
    
#include <stdio.h>

int fun(int a[],int n)
{
  
  /**********Program**********/
  double average;
  int sum=0,i,m=0;
  for(i=0;i<n;i++)
  {
  	sum=sum+a[i];
  }
  average=sum/n;
  for(i=0;i<n;i++)
  {
  	if(a[i]>average)
  	m=m+1;
  }
  return m;
  
  
  
  
  
  
  /**********  End  **********/
  
}
main()
{
  int a[10]={1,3,6,9,4,23,35,67,12,88};
  int y;
  y=fun(a,10);
  printf("y=%d\n",y);
  
}
